tap "homebrew/bundle"
tap "homebrew/services"
brew tap homebrew/cask-fonts

# Application uninstaller
cask "appcleaner"
# Voice and text chat software
cask "discord"
cask "spotify"
cask "whatsapp"
# Fonts
cask "font-fira-code-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# git credential manager
cask "git-credential-manager"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Clipboard manager
cask "maccy"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Screen Recording
cask "obs"
# Serve LLM locally
cask "ollama"
# IDE
cas "visual-studio-code"
