tap "homebrew/bundle"
tap "homebrew/services"
tap "homebrew/cask-fonts"

brew "htop"
brew "btop"
brew "curl"
brew "eza"
# Docker CLI plugin for extended build capabilities with BuildKit
brew "docker-buildx"
# Isolated development environments using Docker
brew "docker-compose"
# Platform keystore credential helper for Docker
brew "docker-credential-helper"
brew "gh"
# Distributed revision control system
brew "git"
brew "git-delta"
# Git extension for versioning large files
brew "git-lfs"
# Better Makefile in Rust
brew "just"
# Modern and fast prompt
brew "starship"
# wget
brew "wget"
# JS runtime builder
brew "oven-sh/bun/bun"



# Application uninstaller
cask "appcleaner"
# Voice and text chat software
cask "discord"
cask "spotify"
cask "whatsapp"
cask "telegram"
# Fonts
cask "font-fira-code-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# git credential manager
cask "git-credential-manager"
# Git GUI
cask "github"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Clipboard manager
cask "maccy"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Screen Recording
cask "obs"
# Serve LLM locally
cask "ollama"
# IDE
cask "visual-studio-code"
# Password manager
cask "1password"
# Docker Desktop
cask "docker"
